---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotCheckoutWorksets
source: html/33bcbb05-a1b2-1f9a-0e06-2f5db23444ab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotCheckoutWorksets Property

Can't make workset editable. User '[Borrowers]' has already checked it out.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCheckoutWorksets { get; }
```